# TotalSize Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DataTransferProgressChangedEventArgs..::..TotalSize Property
DataTransferProgressChangedEventArgs Class See Also
---
Total expected data size to transfer, in bytes.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public double TotalSize { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TotalSize As Double
	Get
```

Visual C++
---
```text
public:
property double TotalSize {
	double get ();
}
```

# See Also
DataTransferProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace